update documentations with mermaid diagrams, add an idp broker documentation
